'''
for循环：

1. 结构一：
语法格式：
for 临时变量 in range():
    重复执行的功能代码

range(start,end,step)：  左闭右开
作用： 用来产生指定范围内一系列连续的整数
3个参数说明：
 start：    开始值      可以不写，默认为0；如果写了则以实际为准
 end:       结束值      必须要写；取到end的前一个
 step:      步长/步距   可以不写，默认为1；如果写了则以实际为准

'''
# print(list(range(3,6,1)))    #[3,4,5]
# print(list(range(4,8,2)))    #[4,6]
# print(list(range(8,4,2)))    #[]
# print(list(range(4,8,-2)))   #[]
# print(list(range(-4,-8,-2)))   #[-4,-6]
# print(list(range(3,7)))      #[3,4,5,6]
# print(list(range(8,2)))      #[]
# print(list(range(4)))        #[0,1,2,3]
# print(list(range(-4)))        #[]

# 1. 打印1-10之间所有的整数(正序打)   1,2,3,4,5,6,7,8,9,10
'''
# 实现方式一： 使用while定次循环实现
#定义计数器
i = 1
#设置进入循环的条件
while i <= 10:
    #重复执行的功能代码：打印i
    print(i)
    #处理计数器
    i += 1

#实现方式二： 使用for循环实现
for i in range(1,11,1):    #i:[1,2,3,4,5,6,7,8,9,10]
    print(i)
 '''
# 2. 打印1-10之间所有的整数(倒序打)    10,9,8,7,6,5,4,3,2,1
'''
for i in range(10,0,-1):     #i:[10,9,8,7,6,5,4,3,2,1]
    print(i)
'''
 # 3. 打印1-10之间所有的偶数(正序打)   2,4,6,8,10
'''
for i in range(2,11,2):     #i:[2,4,6,8,10]
    print(i,end=' ')

for i in range(1,11,1):     #i:[1,2,3,4,5,6,7,8,9,10]
    if i % 2 == 0:
        print(i,end=' ')
'''
# 4. 打印1-10之间所有的奇数(倒序打)   9,7,5,3,1
'''
for i in range(9,0,-2):   #i:[9,7,5,3,1]
    print(i,end=' ')

for i in range(10,0,-1):   #i:[10,9,8,7,6,5,4,3,2,1]
    if i % 2 == 1:
        print(i,end=' ')
'''
# 5. 计算1-10之间所有整数的和
'''
#定义变量，保存最终的和，初值为0
total = 0
#设置进入循环的条件
for i in range(1,11):     #i:[1,2,3,4,5,6,7,8,9,10]
    #重复执行的代码：实现两个数字的加法运算，即上一次的和+本次的i
    total += i
#打印最终的结果
print(total)
'''
# 6. 计算1-10之间所有偶数的和，奇数的积，并求二和最终的和
'''
#定义2个变量，分别保存偶数的和，奇数的积
ou_he = 0
ji_ji = 1
#遍历1-10
for i in range(1,11):    #i:[1,2,3,4,5,6,7,8,9,10]
    #重复执行的代码：判断i为偶数则将i累加到ou_he;否则将i累乘到ji_ji
    if i % 2 == 0:
        ou_he += i
        print(f'第{i//2}次求和的结果为{ou_he-i}+{i}={ou_he}')
    else:
        ji_ji *= i
        print(f'第{(i+1)//2}次求积的结果为{ji_ji//i}*{i}={ji_ji}')
#打印结果
print(f'1-10之间偶数的和为{ou_he},奇数的积为{ji_ji},二者的和为{ou_he+ji_ji}')
'''

# 7. 求100-999之间的所有水仙花数。
#    水仙花数是这个数的每一位上数字的立方和等于这个数本身，比如153=1^3+5^3+3^3=1+125+27=153

#定义变量，保存水仙花数的数量
nums = 0
#定义变量，保存所有的水仙花数
sxh = ''
#遍历100-999
for i in range(100,1000,1):     #i:[100,101,102,.....999]
    #分别计算i的百十个位上的数字  123
    bai = i // 100
    shi = i // 10 % 10
    ge = i % 10
    #判断百的立方+十的立方+个的立方等于i本身，则打印i
    if bai ** 3 + pow(shi,3) + ge ** 3 == i:
        nums += 1
        sxh += str(i) + ' '
print(f'100-999之间的水仙花数共计{nums}个，分别是：{sxh}')


