# 1理论题：
# 1. 常量和变量的区分？
# 常量是固定不变写死的，变量像一块空间，可以存储变化的内容
# 2. 写出变量命名时的规则？
# ①见名应知意，变量名字应该是符合意义
# ②以数字和字母以及下划线组成，不能以数字开头
# 3.python中简单的数据类型有哪些？字符串怎么表示?
# int float str bool
# 字符串写在单引号，双引号，三引号中
# 4.python中复杂的数据类型有哪些（数据结构）？
# 字典，元组和列表
# 5.python中字符串内容怎么做转义?字符串的格式化两种写法？
# 用/+特定字符，比如/n是换行符
# 第一种
# print(f"{变量}")
# 第二种 占位符
# print("%d"%变量)
# #
# 代码题：
# 1. 使用print()函数输出“Hello World！HZDL{3}”

#    1)word!后换行输出
print("“Hello World！\n HZDL{3}")
#    2)不换行输出
print("“Hello World！HZDL{3}")
#    3)把数字3和其它部分用|隔开
print("“Hello World！HZDL{|3|}")
# 2. 用两种方式将  It's Sunday today！ 打印输出
print('It\'s Sunday today！')
print("It's Sunday today！")
# 3. 输出 c:\trasert\net.txt
print(r'c:\trasert\net.txt')
# 4. 使用print(“hello\n”*8)和print(“hello”*8)看输出结果
print("hello\n"*8)
print("hello"*8)
# 5. 格式化输出个人名片。
# 定义变量：姓名，公司，职位，电话，邮箱,工资(小数点后保留2位)。按照以下格式输出：
# **************************************************
# 公司名称 :
# 姓名(职位):
# 电话：
# 邮箱：
# 工资:
# **************************************************
# 注意：两行星星也要打印
# 要求使用三种方式分别打印名片
# 姓名，公司，职位，电话，邮箱,工资
name = "王五"
gongsi = "汇智"
zhiwei = "学生"
tel = "198970695"
email = "2638573827@qq.com"
money = 6000.123
print("**************************************************\n公司名称 :%s\n姓名:%s\n职位:%s\n电话：%s\n邮箱：%s\n工资:%.2f\n**************************************************" % (name, gongsi, zhiwei, tel, email, money))
print("**************************************************\n公司名称 :", name, "\n姓名:", name, "\n职位:", zhiwei, "\n电话：", tel, "\n邮箱：", email, "\n工资:", money, "\n**************************************************")
print(f"**************************************************\n公司名称 :{gongsi}\n姓名:{name}\n职位:{zhiwei}\n电话：{tel}\n邮箱：{email}\n工资:{money}\n**************************************************")