'''
运算：
1. 算术运算符
    +      加法        数字类型可以做加法运算
                       字符串也可以做加法运算，但是必须是str+str,实现将字符串无缝拼接
    -      减法        只有数字类型可以做减法运算
    *      乘法        数字类型可以做乘法运算
                       字符串也可以做乘法运算，但是必须是 str*n(正整数),实现将字符串复制n倍
    /      除法        只有数字类型可以做除法运算
    //     取整        比如：print(9//2)-->4
    %      取余        比如：print(9%2)-->1
    **     幂指运算    比如：print(2**4)-->16

2. 赋值运算符
    =      赋值运算符     将=右边的结果赋给左边的变量

3. 复合赋值运算符
    +=	   加法赋值运算符	  c += a 等效于 c = c + a
    -=	   减法赋值运算符	  c -= a 等效于 c = c - a
    *=	   乘法赋值运算符	  c *= a 等效于 c = c * a
    /=	   除法赋值运算符	  c /= a 等效于 c = c / a
    %=	   取模赋值运算符	  c %= a 等效于 c = c % a
    **=	   幂赋值运算符	      c **= a 等效于 c = c ** a
    //=	   取整除赋值运算符	  c //= a 等效于 c = c // a
'''
# print(5+2)         #7
# print(5.4+4.5)     #9.9
# print(-1-2)        #-3
# print('你'+'我'+'他')   #'你我他'
# # print('你'+2)      #报错
#
# print(9-3)        #6
# print(3-1.1)      #1.9
# print(-3-8)       #-11
# # print('你我他'-'他')   #报错
#
# print(2*4)       #8
# print('你'*3)    #‘你你你’
# print('你'*0)    # ''
# print('你'*-1)   # ''
# # print('你'*0.5)  # 报错
#
# print(9/3)      #3
# print(9.9/3.3)  #3
# # print('你你你'/3)   #报错
# # print('你你你'/'你')  #报错
#
# print(9//2)      #4
# print(9%2)       #1
# print(9//3)      #3
# print(9%3)       #0
# print(2**4)      #16
# print(pow(2,4))  #16
# print(2**32-1)    #4294967295
# print(pow(2,32)-1)  #4294967295

# #1. 计算一个任意四位正整数上的每位数字之和，比如：1234-->1+2+3+4=10
# #定义一个变量，保存一个4位正整数
# num = 1234
# #分别计算出千十百个位上的数字
# qian =  num // 1000                     #1234-->1
# bai1 =  num % 1000 // 100               #1234-->234-->2
# bai2 =  num // 100 % 10                 #1234-->12-->2
# shi1 =  num // 10 % 10                  #1234-->123-->3
# shi2 = num  % 100 // 10                 #1234-->34-->3
# ge = num % 10
# #求和
# he = qian + bai1 + shi1 + ge
# #打印
# print(f'{num}这个四位正整数的千位是{qian}，百位是{bai2}，十位是{shi2}，个位是{ge}，每位数字之和是{he}')

num1 = 10
num2 = 20
num1 += num2
print(num1,num2)     #num1=30  num2=20
num2 -= num1
print(num1,num2)     #num1=30  num2=-10
num1 *= num2
print(num1,num2)     #num1=-300  num2=-10
num1 /= num2
print(num1,num2)     #num1 = 30  num2= -10
num1 //= num2
print(num1,num2)     #num1 = -3    num2 = -10
num2 %= num1
print(num1,num2)    #num1=-3   num2=-1
num2 **= num1
print(num1,num2)    #num1=-3   num2=-1

