# 理论题：
# 6.python中数据类型转换有哪些函数？数据类型转换要注意什么？

# int()：转为整数
# float()：转为浮点数
# str()：转为字符串
# bool()：转为布尔值
# 不是所有类型都能互相转换,比如字母字符串不能转int/float,会报错。
# 浮点数转整数会直接截断小数部分,不会四舍五入。
# 空值None、0、空字符串、空列表、空元组、空字典、转换为bool是False,其他大多是 True。

# 7.判断结构有哪几种？通过什么判断要执行分支中的哪个执行语句？

# ①if
# ②if else
# ③if elif else
# 通过条件语句的执行结果来判断,结果为True则执行,False则跳过执行下一个

# 8.判断语句中, 构成条件语句的所有运算符或特殊数值?

# ①比较运算符
# > 大于
# < 小于
# >= 大于等于
# <= 小于等于
# == 等于
# != 不等于
# ②逻辑运算符
# and 且，与
# or 或
# not 非
# ③特殊数值
# 为0的数字、空字符串、空值None、空集合都被认为是False
# 其他皆为True

# 判断语句题目：
# 1.编写程序，从键盘获取用户名和密码，然后判断(自己预先设定一个正确的用户名和密码)，如果正确就输出以下信息
# == == == == == == == == == == == == == == == == == == == == == == ==
# =     亲爱的XXX, 欢迎进入到身份认证系统V1.0
# = 1.登录
# = 2.退出
# = 3.认证
# = 4.修改密码
# == == == == == == == == == == == == == == == == == == == == == == ==
# 如果不正确, 就提示用户”Bye bye!”

# user=input('请输入你的用户名：')
# password=input('请输入你的密码：')
# u='balala'
# p=123456
# d='=='*40
# h='=    亲爱的XXX, 欢迎进入到身份认证系统V1.0'
# e='= 1.登录'
# c='= 2.退出'
# g='= 3.认证'
# k='= 4.修改密码'
# if user==u:
#     print(f'{d}\n{h}\n{e}\n{c}\n{g}\n{k}\n{d}')
# else:
#     print('Bye bye!')


# 2.企业发放的奖金根据利润提成, 利润低于或等于10万元时, 奖金可提成10 %, 利润高于10万元时, 低于20万元时,低于10万元部分按10 % 提成, 高于10万元部分按7.5 % 提成, 20 - 40万时, 高于20万部分, 可提成5 %, 40 - 60万时,高于40万部分, 可提成3 %, 60 - 100万时, 高于60万部分, 可提成1.5 %, 高于100万的部分, 可提成1 %,从键盘输入当月利润,求应发放的奖金总数?

# profit = int(input("请输入当月利润（万元）："))
#
# if profit <= 10:
#     bonus = profit * 0.1
# elif profit <= 20:
#     bonus = 10 * 0.1 + (profit - 10) * 0.075
# elif profit <= 40:
#     bonus = 10 * 0.1 + 10 * 0.075 + (profit - 20) * 0.05
# elif profit <= 60:
#     bonus = 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + (profit - 40) * 0.03
# elif profit <= 100:
#     bonus = 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + (profit - 60) * 0.015
# else:
#     bonus = 10 * 0.1 + 10 * 0.075 + 20 * 0.05 + 20 * 0.03 + 40 * 0.015 + (profit - 100) * 0.01
#
# print("应发放奖金总数为：%.2f万元"%bonus)



# 3.输入用户的身高信息, 单位为米，输入用户的体重信息, 单位为kg。请根据BMI公式（体重除以身高的平方）帮用户计算他的BMI指数，并根据BMI指数给出对应的提示信息：
# 低于18.5：过轻
# 18.5 - 25：正常
# 25 - 28：过重
# 28 - 32：肥胖
# 高于32：严重肥胖

# height=float(input('请输入你的身高(m)：'))
# weight=float(input('请输入你的体重(kg)：'))
# BMI=weight/(height**2)
#
# if BMI<18.5:
#     print('低于18.5，过轻')
# elif 18.5<=BMI<=25:
#     print('18.5-25，正常')
# elif 25<BMI<=28:
#     print('25-28，过重')
# elif 28<BMI<=32:
#     print('28-32，肥胖')
# else:
#     print('高于32，严重肥胖')



# 4.请根据男女, 输入你的各项参数, 计算你的体脂率:
# 成年女性的体脂率计算公式：
# 参数a = 腰围（cm）×0.74
# 参数b = 体重（kg）×0.082 + 34.89
# 体脂肪重量（kg）=a－b
# 体脂率 =（身体脂肪总重量÷体重）×100 %
# 成年男性的体脂率计算公式：
# 参数a = 腰围（cm）×0.74
# 参数b = 体重（kg）×0.082 + 44.74
# 体脂肪重量（kg）=a－b
# 体脂率 =（身体脂肪总重量÷体重）×100 %。
# 成年人的体脂率正常范围分别是女性20 %～25 %，男性15 %～18 %，若体脂率过高，就有肥胖的风险。请提示用户是否可能属肥胖。
#
# sex = input("请输入性别（男/女）：")
# yaowei = float(input("请输入腰围（cm）："))
# weight = float(input("请输入体重（kg）："))
#
# a = yaowei * 0.74
#
# if sex == "男":
#     b = weight * 0.082 + 44.74
# elif sex == "女":
#     b = weight * 0.082 + 34.89
# else:
#     print("性别输入错误，请输入“男”或“女”")
#
# # 体脂肪重量
# body_weight = a - b
#
# # 体脂率
# fat_rate = (body_weight / weight) * 100
#
# print(f"\n体脂肪重量：{body_weight:.2f} kg")
# print(f"体脂率：{fat_rate:.2f}%")
#
# if sex == "女":
#     if 20 <= fat_rate <= 25:
#         print("体脂率正常")
#     else:
#         print("体脂率异常，存在肥胖风险")
# else:
#     if 15 <= fat_rate <= 18:
#         print("体脂率正常")
#     else:
#         print("体脂率异常，存在肥胖风险")




# 5.用户和计算机玩石头剪刀布的游戏，计算机随机出一个(其中：0代表石头，1代表剪刀，2代表布)，由人来猜；如果人猜的与计算机出的一致，则打印“平局”
#如果人赢了，则打印“你赢了”，否则打印“你输了”

import random
computer = random.randint(0,2)
user=int(input('请输入0,1,2中任意一个数字(其中:0代表石头，1代表剪刀，2代表布):'))

if user==computer:
    print('平局')
elif (user == 0 and computer == 1) or (user == 1 and computer == 2) or (user == 2 and computer == 0):
    print("你赢了")
else:
    print("你输了")
